app/Controllers/AuthController.php

    public function storeLoginAdmin()
    {
        if(!$this->validate([
            'username' => 'required',
            'password' => 'required'
        ])){
            return redirect()->back()->withInput();
        }
        $adminModel = new AdminModel();
        try{
            $admin = $adminModel->where('username', $this->request->getPost('username'))->first();
---
SELECT *
FROM `admin`
WHERE `username` = 'test'
 LIMIT 1