app/Controllers/DashboardController.php

    public function admin()
    {
        $adminModel = new AdminModel();
        $admin = $adminModel->find(session('id'));

        $totalPendaftar = $this->ppdbModel->selectCount('ppdb_id')->countAllResults();
        $totalBelumLengkap = $this->ppdbModel->selectCount('ppdb_id')->where('status', 'Belum Lengkap')->countAllResults();
        $totalDiproses = $this->ppdbModel->selectCount('ppdb_id')->where('status', 'Diproses')->countAllResults();
        $totalLulus = $this->ppdbModel->selectCount('ppdb_id')->where('status', 'Lulus')->countAllResults();
        $totalGagal = $this->ppdbModel->selectCount('ppdb_id')->where('status', 'Gagal')->countAllResults();
        $totalDitolak = $this->ppdbModel->selectCount('ppdb_id')->where('status', 'Ditolak')->countAllResults();
---
SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `ppdb`
SELECT COUNT(*) AS `numrows`
FROM `ppdb`
WHERE `status` = 'Belum Lengkap'
SELECT COUNT(*) AS `numrows`
FROM `ppdb`
WHERE `status` = 'Diproses'
SELECT COUNT(*) AS `numrows`
FROM `ppdb`
WHERE `status` = 'Lulus'
SELECT COUNT(*) AS `numrows`
FROM `ppdb`
WHERE `status` = 'Gagal'
SELECT COUNT(*) AS `numrows`
FROM `ppdb`
WHERE `status` = 'Ditolak'