app/Controllers/ManajemenPpdbController.php

SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '1'
SELECT *
FROM `ppdb`
SELECT *
FROM `ppdb`
WHERE `status` = 'Ditolak'
---
    public function index()
    {
        $status = $this->request->getGet('filter') ?? '';
        $admin = $this->adminModel->find(session('id'));
        $ppdb = $this->ppdbModel->findAll();
        if($status){
            $ppdb = $this->ppdbModel->where('status', $status)->findAll();